# Definition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..Definition Property
FamilyParameter Class See Also
---
The definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Definition Definition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Definition As Definition
	Get
```

Visual C++
---
```text
public:
property Definition^ Definition {
	Definition^ get ();
}
```

# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace